experiment-finetuned/all_finetuned/runs/Cylinder/1/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    // Block 0 - bottom left
    (-1 -1 -0.5)   // 0
    (-0.5 -1 -0.5) // 1
    (-0.5 -0.5 -0.5) // 2
    (-1 -0.5 -0.5) // 3
    (-1 -1 0.5)    // 4
    (-0.5 -1 0.5)  // 5
    (-0.5 -0.5 0.5) // 6
    (-1 -0.5 0.5)  // 7

    // Block 1 - bottom right
    (-0.5 -1 -0.5) // 8
    (1 -1 -0.5)    // 9
    (1 -0.5 -0.5)  // 10
    (-0.5 -0.5 -0.5) // 11
    (-0.5 -1 0.5)  // 12
    (1 -1 0.5)     // 13
    (1 -0.5 0.5)   // 14
    (-0.5 -0.5 0.5) // 15

    // Block 2 - top left
    (-1 -0.5 -0.5) // 16
    (-0.5 -0.5 -0.5) // 17
    (-0.5 1 -0.5)  // 18
    (-1 1 -0.5)    // 19
    (-1 -0.5 0.5)  // 20
    (-0.5 -0.5 0.5) // 21
    (-0.5 1 0.5)   // 22
    (-1 1 0.5)     // 23

    // Block 3 - top right
    (-0.5 -0.5 -0.5) // 24
    (1 -0.5 -0.5)   // 25
    (1 1 -0.5)      // 26
    (-0.5 1 -0.5)   // 27
    (-0.5 -0.5 0.5) // 28
    (1 -0.5 0.5)    // 29
    (1 1 0.5)       // 30
    (-0.5 1 0.5)    // 31
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 20 1) simpleGrading (1 1 1)
    hex (8 9 10 11 12 13 14 15) (60 20 1) simpleGrading (1 1 1)
    hex (16 17 18 19 20 21 22 23) (20 60 1) simpleGrading (1 1 1)
    hex (24 25 26 27 28 29 30 31) (60 60 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (16 20 23 19)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (9 13 14 10)
            (25 29 30 26)
        );
    }
    top
    {
        type wall;
        faces
        (
            (19 23 22 18)
            (27 31 30 26)
        );
    }
    bottom
    {
        type wall;
        faces
        (
            (0 1 2 3)
            (8 9 10 11)
        );
    }
    cylinder
    {
        type wall;
        faces
        (
            (1 5 6 2)
            (17 21 22 18)
            (11 15 14 10)
            (24 28 29 25)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //