experiment-finetuned/all_finetuned/runs/Cylinder/1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    inlet
    {
        type            patch;
        nFaces          80;
        startFace       12480;
    }
    outlet
    {
        type            patch;
        nFaces          80;
        startFace       12560;
    }
    top
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          80;
        startFace       12640;
    }
    bottom
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1600;
        startFace       12720;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          200;
        startFace       14320;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          0;
        startFace       14520;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          11400;
        startFace       14520;
    }
)

// ************************************************************************* //
